pureDEM/test3/openHFDIB-STL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-5 0 -5) 
    (5 0 -5) 
    (5 40 -5) 
    (-5 40 -5)
    (-5 0 5) 
    (5 0 5) 
    (5 40 5) 
    (-5 40 5) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 160 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)     
        );
    }
    outlet
    {
        type patch;
        faces
        (
          (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
