pureDEM/test3/openHFDIB-STL/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere_Top");

surfaceThreshold    1e-4;
stepDEM     0.01;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep true;
nSolidsInDomain 100;

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.0;
            mu      0.0;
            adhN    0.0;
			eps	 	0.85;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            mu      0.0;
            adhN    0.0;
			eps	 	0.85;
        }
    }
    LcCoeff 4;	

	collisionPatches
    {
		wall0
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.05 0.0 0.0);
		}
		wall1
		{
			material wall;
			nVec (0.0 0.0 1.0);
			planePoint (0.0 0.0 0.05);
		}
		wall2
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.05 0.0 0.0);
		}
		wall3
		{
			material wall;
			nVec (0.0 0.0 -1.0);
			planePoint (0.0 0.0 -0.05);
		}
		wall4
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 0.0 0.0);
		}		
		wall5
		{
			material wall;
			nVec (0.0 1.0 0.0);
			planePoint (0.0 0.4 0.0);
		}
    }
}

virtualMesh
{
    level 4;
    charCellSize 0.001;
	recordContact false;
}

sphere_Top
{

	fullyCoupledBody;

	rho         rho [1 -3 0 0 0 0 0] 5000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel onceScatter;
		onceScatterCoeffs
		{
			addMode fieldBased;
			fieldBasedCoeffs
			{
				fieldName lambda;
				fieldValue 1;
			}
			addDomain boundBox;
			boundBoxCoeffs
			{
				minBound (-0.04 0.01 -0.04);
				maxBound (0.04 0.39 0.04);
			}
			
			scalingMode    noScaling;
			noScalingCoeffs{}
			
			rotationMode   randomRotation;
			randomRotationCoeffs{}
		}
	}
		
	material particle;
	bodyGeom convex;
	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 0;
	timesToSetStatic -1;
}

// ************************************************************************* //

